---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CouplerWidth
source: html/309c3bb5-2bfd-68d0-72ac-496e0540edf1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CouplerWidth Property

"External Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId CouplerWidth { get; }
```